# Terraform - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production/runs/run-LuXweHtVpyZPJSjD

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common.module.identity.tfe_variable.identity_TF_VAR_UPSTASH_API_KEY: Refreshing state... [id=var-ALnybLEu3LxdkarR]
module.common.data.tfe_organization.default: Refreshing...
module.common.module.organization.tfe_variable.organization_TF_VAR_UPSTASH_API_KEY: Refreshing state... [id=var-6M9PpkC8fFmDYEku]
module.common.module.shared.tfe_variable.shared_TF_VAR_UPSTASH_API_KEY: Refreshing state... [id=var-MrAUfRCjbudNpNoq]
module.common.module.customer.tfe_variable.customer_TF_VAR_UPSTASH_API_KEY: Refreshing state... [id=var-v4bgChkaUyLqZUom]
module.common.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common.tfe_project.default: Refreshing state... [id=prj-zV9LYGTL4XmQDhoh]
module.common.data.tfe_workspace.default: Refreshing...
module.common.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-EVX6ZGyhH3ZAXk2V]
module.common.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-gVRofzq4w6zjDR1e]
module.common.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-hQ3MnLAQtYcF5jZy]
module.common.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-wogTPwhKVgUx7L3G]
module.common.module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-mpyan6rTD44jwoLm]
module.common.module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-DM5xTu1DYURSci3h]
module.common.module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-SKJ8p6Lu8GYw86HW]
module.common.module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-6q8i5NcNLnYDwzz9]
module.common.module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-VzyFF3RQq2tTsmtC]
module.common.module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-JNkH3eqRD3ier3Kg]
module.common.module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-GiRtuuz5JqfvVoZa]
module.common.module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-AfZQyrCC4aTbjd2n]
module.common.module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-ZTQFNTCSotLKJ2XQ]
module.common.module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-9dJfPtHDzGuXtBSi]
module.common.module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-Wx2N6AA5qtgSQFJD]
module.common.module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-jAL6h4H5fP1fHEFL]
module.common.data.tfe_workspace.default: Refresh complete after 0s [id=ws-UmJqcbXkYoY7jfTM]
module.common.data.tfe_variables.default: Refreshing...
module.common.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-UmJqcbXkYoY7jfTM]
module.common.module.customer.tfe_workspace.customer: Drift detected (update)
module.common.module.identity.tfe_workspace.identity: Drift detected (update)
module.common.module.organization.tfe_workspace.organization: Drift detected (update)
module.common.module.shared.tfe_workspace.shared: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.common.module.customer.tfe_variable.customer_TF_VAR_UPSTASH_API_KEY will be destroyed
  # (because tfe_variable.customer_TF_VAR_UPSTASH_API_KEY is not in configuration)
  - resource "tfe_variable" "customer_TF_VAR_UPSTASH_API_KEY" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-v4bgChkaUyLqZUom" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-hQ3MnLAQtYcF5jZy" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_upstash_api_key will be created
  + resource "tfe_variable" "customer_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_upstash_api_key will be created
  + resource "tfe_variable" "customer_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-hQ3MnLAQtYcF5jZy"
    }

  # module.common.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-zV9LYGTL4XmQDhoh"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/production"
    }

  # module.common.module.identity.tfe_variable.identity_TF_VAR_UPSTASH_API_KEY will be destroyed
  # (because tfe_variable.identity_TF_VAR_UPSTASH_API_KEY is not in configuration)
  - resource "tfe_variable" "identity_TF_VAR_UPSTASH_API_KEY" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ALnybLEu3LxdkarR" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-wogTPwhKVgUx7L3G" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_upstash_api_key will be created
  + resource "tfe_variable" "identity_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_upstash_api_key will be created
  + resource "tfe_variable" "identity_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-wogTPwhKVgUx7L3G"
    }

  # module.common.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-identity-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-zV9LYGTL4XmQDhoh"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/identity-api/infrastructure/workspaces/production"
    }

  # module.common.module.organization.tfe_variable.organization_TF_VAR_UPSTASH_API_KEY will be destroyed
  # (because tfe_variable.organization_TF_VAR_UPSTASH_API_KEY is not in configuration)
  - resource "tfe_variable" "organization_TF_VAR_UPSTASH_API_KEY" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-6M9PpkC8fFmDYEku" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-gVRofzq4w6zjDR1e" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_upstash_api_key will be created
  + resource "tfe_variable" "organization_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_upstash_api_key will be created
  + resource "tfe_variable" "organization_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-gVRofzq4w6zjDR1e"
    }

  # module.common.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-organization-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-zV9LYGTL4XmQDhoh"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/organization-api/infrastructure/workspaces/production"
    }

  # module.common.module.shared.tfe_variable.shared_TF_VAR_UPSTASH_API_KEY will be destroyed
  # (because tfe_variable.shared_TF_VAR_UPSTASH_API_KEY is not in configuration)
  - resource "tfe_variable" "shared_TF_VAR_UPSTASH_API_KEY" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-MrAUfRCjbudNpNoq" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-EVX6ZGyhH3ZAXk2V" -> null
    }

  # module.common.module.shared.tfe_variable.shared_upstash_api_key will be created
  + resource "tfe_variable" "shared_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = "ws-EVX6ZGyhH3ZAXk2V"
    }

Plan: 19 to add, 0 to change, 4 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*